StartMilandr/MDR_Pack_v6/SVD_Files/RST/MDR1986VK234_RST.svd
        <!-- TIM_CLOCK -->
        <register>
          <name>TIM_CLOCK</name>
          <description>Timer's Clock Control</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x07070707</resetMask--><!--#BE1,#BE3,#BE9x,#VC1-->
          <resetMask>0x03000707</resetMask><!--#BE4,#BK214,#BK234-->
          <fields>
            <!-- TIM_CLOCK.TIM1_BRG -->
            <field>
              <name>TIM1_BRG</name>
              <!--description>HCLK freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BE1,#BE3,#BE9x,#VC1-->
              <description>PER1_C2 freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]</description><!--#BE4,#BK234-->
              <!--description>TIM1_C2 freq divider to get TIM1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BK214-->
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM1__BRG_</headerEnumName>
                <enumeratedValue><name>div1</name><description>div by 1</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>div2</name><description>div by 2</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>div4</name><description>div by 4</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>div8</name><description>div by 8</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>div16</name><description>div by 16</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>div32</name><description>div by 32</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>div64</name><description>div by 64</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>div128</name><description>div by 128</description><value>7</value></enumeratedValue>
              </enumeratedValues>              
            </field>
            <!-- TIM_CLOCK.TIM2_BRG -->
            <field derivedFrom="TIM1_BRG">
              <name>TIM2_BRG</name>
              <!--description>HCLK freq divider to get TIM2_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BE1,#BE3,#BE9x,#VC1-->
              <description>PER1_C2 freq divider to get TIM2_CLOCK, [/1, /2, /4 .. /128]</description><!--#BE4,#BK234-->
              <!--description>TIM2_C2 freq divider to get TIM2_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BK214-->
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- TIM_CLOCK.TIM3_BRG -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field derivedFrom="TIM1_BRG">
              <name>TIM3_BRG</name>
              <description>HCLK freq divider to get TIM3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field-->
            <!-- TIM_CLOCK.TIM1_CLK_EN -->
            <field>
              <name>TIM1_CLK_EN</name>
              <description>TIM1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- TIM_CLOCK.TIM2_CLK_EN -->
            <field>
              <name>TIM2_CLK_EN</name>
              <description>TIM2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- TIM_CLOCK.TIM3_CLK_EN -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>TIM3_CLK_EN</name>
              <description>TIM3_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__TIM__TIM3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!-- TIM_CLOCK fields end-->
          </fields>
        </register>

        <!-- UART_CLOCK-->
        <register>
          <name>UART_CLOCK</name>
          <description>UART's Clock Control</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x07070707</resetMask--><!--#BE1,#BE3,#VC1-->
          <resetMask>0x03000707</resetMask><!--#BE9x,#BE4,#BK214,#BK234-->
          <fields>
            <!-- UART_CLOCK.UART1_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART1_BRG</name>
              <!--description>HCLK freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BE1,#BE3,#BE9x,#VC1-->
              <description>PER1_C2 freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]</description><!--#BE4,#BK234-->
              <!--description>UART1_C2 freq divider to get UART1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BK214-->
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <!-- UART_CLOCK.UART2_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART2_BRG</name>
              <!--description>HCLK freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BE1,#BE3,#BE9x,#VC1-->
              <description>PER1_C2 freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]</description><!--#BE4,#BK234-->
              <!--description>UART1_C2 freq divider to get UART2_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BK214-->
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- UART_CLOCK.TIM4_BRG -->
            <!--#BE1,#BE3-->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>TIM4_BRG</name>
              <description>HCLK freq divider to get TIM4_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field-->
            <!-- UART_CLOCK.UART3_BRG -->
            <!--#VC1-->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART3_BRG</name>
              <description>HCLK freq divider to get UART3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field-->

            <!-- UART_CLOCK.UART1_CLK_EN -->
            <field>
              <name>UART1_CLK_EN</name>
              <description>UART1_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_CLOCK.UART2_CLK_EN -->
            <field>
              <name>UART2_CLK_EN</name>
              <description>UART2_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_CLOCK.TIM4_CLK_EN -->
            <!--#BE1,#BE3-->
            <!--field>
              <name>TIM4_CLK_EN</name>
              <description>TIM4_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__TIM4_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Timer4 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Timer4 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->
            <!-- UART_CLOCK.UART3_CLK_EN -->
            <!--#VC1-->
            <!--field>
              <name>UART3_CLK_EN</name>
              <description>UART3_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UART__UART3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field-->

            <!-- UART_CLOCK fields end-->
          </fields>
        </register>

        <!-- SSP_CLOCK -->
        <register>
          <name>SSP_CLOCK</name>
          <description>SSP's Clock Control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--resetMask>0x07070707</resetMask--><!--#BE1,#BE3,#BE9x,#VC1-->
          <resetMask>0x01000007</resetMask><!--#BE4,#BK214,#BK234-->

          <fields>
            <!-- SSP_CLOCK.SSP1_BRG -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP1_BRG</name>
              <!--description>HCLK freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BE1,#BE3,#BE9x,#VC1-->
              <description>PER1_C2 freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]</description><!--#BE4,#BK234-->
              <!--description>SSP1_C2 freq divider to get SSP1_CLOCK, [/1, /2, /4 .. /128]</description--><!--#BK214-->
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>

            <!-- SSP_CLOCK.SSP2_BRG -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">            
              <name>SSP2_BRG</name>
              <description>HCLK freq divider to get SSP2_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- SSP_CLOCK.SSP3_BRG -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP3_BRG</name>
              <description>HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>

            <!-- SSP_CLOCK.SSP1_CLK_EN -->
            <field>
              <name>SSP1_CLK_EN</name>
              <description>SSP1_CLOCK Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP1_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP1 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP1 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- SSP_CLOCK.SSP2_CLK_EN -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>SSP2_CLK_EN</name>
              <description>SSP2_CLOCK Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP2 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP2 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- SSP_CLOCK.SSP3_CLK_EN -->
            <!--#BE1,#BE3,#BE9x,#VC1-->
            <!--field>
              <name>SSP3_CLK_EN</name>
              <description>SSP3_CLOCK Enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__SSP__SSP3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- SSP_CLOCK fields end-->
          </fields>
        </register>

        <!-- DSP_CLOCK -->
        <!--#VC1-->
        <!--register>
          <name>DSP_CLOCK</name>
          <description>DSP Clock Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000117</resetMask>
          <fields>
            <!-- DSP_CLOCK.DSP_C1_SEL -->
            <!--field>
              <name>DSP_C1_SEL</name>
              <description>DSP_C1 mux freq select</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__C1_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>DSP_C1 output is HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI/2</name>
                  <description>DSP_C1 output is HSI/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>DSP_C1 output is HSE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE/2</name>
                  <description>DSP_C1 output is HSE/2</description>
                  <value>3</value>
                </enumeratedValue>                                
              </enumeratedValues>
            </field>
            <!-- DSP_CLOCK.DSP_C2_SEL -->
            <!--field>
              <name>DSP_C2_SEL</name>
              <description>DSP_C2 mux freq select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__C2_</headerEnumName>
                <enumeratedValue>
                  <name>DSP_C1</name>
                  <description>Freq from DSP_C1 mux direct</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLDSPo</name>
                  <description>Freq from CPU_C1 mux through PLL_DSP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- DSP_CLOCK.DSP_C3_SEL -->
            <!--field>
              <name>DSP_C3_SEL</name>
              <description>DSP_C3 Input Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__C3_</headerEnumName>
                <enumeratedValue>
                  <name>DSP_C2</name>
                  <description>C3 Input is freq from C2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_C2_div2</name>
                  <description>C3 Input is freq from C2/2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- DSP_CLOCK.DSP_EN -->
            <!--field>
              <name>DSP_EN</name>
              <description>DSP Clock Enable</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__DSP__CLOCK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- DSP_CLOCK fields end-->
          <!--/fields>
        </register-->

